In [1]:
import pandas as pd
import numpy as np

In [2]:
data = np.random.randn(4,3)

In [3]:
data

array([[ 0.95636563, -0.36215797,  0.45771207],
       [ 0.45626892, -0.8463591 ,  0.19336116],
       [-0.32259178,  1.17366566, -0.55444059],
       [-0.69760261, -0.46241371,  1.48574526]])

In [4]:
dataFrame = pd.DataFrame(data)

In [5]:
type(dataFrame[0])

pandas.core.series.Series

In [6]:
dataFrame

          0         1         2
0  0.956366 -0.362158  0.457712
1  0.456269 -0.846359  0.193361
2 -0.322592  1.173666 -0.554441
3 -0.697603 -0.462414  1.485745

In [7]:
yeniDataFrame = pd.DataFrame(data,index=["Atil","Zeynep","Atlas","Mehmet"],columns = ["Maas","Yas","Calisma Saati"])

In [8]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.956366 -0.362158       0.457712
Zeynep  0.456269 -0.846359       0.193361
Atlas  -0.322592  1.173666      -0.554441
Mehmet -0.697603 -0.462414       1.485745

In [9]:
yeniDataFrame["Yas"]

Atil     -0.362158
Zeynep   -0.846359
Atlas     1.173666
Mehmet   -0.462414
Name: Yas, dtype: float64

In [10]:
yeniDataFrame["Calisma Saati"]

Atil      0.457712
Zeynep    0.193361
Atlas    -0.554441
Mehmet    1.485745
Name: Calisma Saati, dtype: float64

In [11]:
yeniDataFrame[["Maas","Yas"]]

            Maas       Yas
Atil    0.956366 -0.362158
Zeynep  0.456269 -0.846359
Atlas  -0.322592  1.173666
Mehmet -0.697603 -0.462414

In [12]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.956366 -0.362158       0.457712
Zeynep  0.456269 -0.846359       0.193361
Atlas  -0.322592  1.173666      -0.554441
Mehmet -0.697603 -0.462414       1.485745

In [13]:
yeniDataFrame.loc["Atil"]

Maas             0.956366
Yas             -0.362158
Calisma Saati    0.457712
Name: Atil, dtype: float64

In [14]:
yeniDataFrame.loc["Zeynep"]

Maas             0.456269
Yas             -0.846359
Calisma Saati    0.193361
Name: Zeynep, dtype: float64

In [15]:
yeniDataFrame.iloc[1]

Maas             0.456269
Yas             -0.846359
Calisma Saati    0.193361
Name: Zeynep, dtype: float64

In [16]:
yeniDataFrame["Maas"]

Atil      0.956366
Zeynep    0.456269
Atlas    -0.322592
Mehmet   -0.697603
Name: Maas, dtype: float64

In [17]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [18]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    0.956366 -0.362158       0.457712       -0.724316
Zeynep  0.456269 -0.846359       0.193361       -1.692718
Atlas  -0.322592  1.173666      -0.554441        2.347331
Mehmet -0.697603 -0.462414       1.485745       -0.924827

In [19]:
yeniDataFrame.drop("Emeklilik Yasi",axis = 1)

            Maas       Yas  Calisma Saati
Atil    0.956366 -0.362158       0.457712
Zeynep  0.456269 -0.846359       0.193361
Atlas  -0.322592  1.173666      -0.554441
Mehmet -0.697603 -0.462414       1.485745

In [20]:
yeniDataFrame.drop("Mehmet", axis = 0)

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    0.956366 -0.362158       0.457712       -0.724316
Zeynep  0.456269 -0.846359       0.193361       -1.692718
Atlas  -0.322592  1.173666      -0.554441        2.347331

In [21]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    0.956366 -0.362158       0.457712       -0.724316
Zeynep  0.456269 -0.846359       0.193361       -1.692718
Atlas  -0.322592  1.173666      -0.554441        2.347331
Mehmet -0.697603 -0.462414       1.485745       -0.924827

In [22]:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1, inplace=True)

In [23]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.956366 -0.362158       0.457712
Zeynep  0.456269 -0.846359       0.193361
Atlas  -0.322592  1.173666      -0.554441
Mehmet -0.697603 -0.462414       1.485745

In [24]:
yeniDataFrame.loc["Atil"]["Calisma Saati"]

0.4577120707057123

In [25]:
yeniDataFrame.loc["Atlas","Yas"]

1.1736656587268508

In [26]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.956366 -0.362158       0.457712
Zeynep  0.456269 -0.846359       0.193361
Atlas  -0.322592  1.173666      -0.554441
Mehmet -0.697603 -0.462414       1.485745

In [27]:
booleanFrame = yeniDataFrame < 0

In [28]:
booleanFrame

         Maas    Yas  Calisma Saati
Atil    False   True          False
Zeynep  False   True          False
Atlas    True  False           True
Mehmet   True   True          False

In [29]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.956366 -0.362158       0.457712
Zeynep  0.456269 -0.846359       0.193361
Atlas  -0.322592  1.173666      -0.554441
Mehmet -0.697603 -0.462414       1.485745

In [30]:
yeniDataFrame[booleanFrame]

            Maas       Yas  Calisma Saati
Atil         NaN -0.362158            NaN
Zeynep       NaN -0.846359            NaN
Atlas  -0.322592       NaN      -0.554441
Mehmet -0.697603 -0.462414            NaN

In [31]:
yeniDataFrame[yeniDataFrame < 0]

            Maas       Yas  Calisma Saati
Atil         NaN -0.362158            NaN
Zeynep       NaN -0.846359            NaN
Atlas  -0.322592       NaN      -0.554441
Mehmet -0.697603 -0.462414            NaN

In [32]:
yeniDataFrame[yeniDataFrame["Calisma Saati"] > 0]

            Maas       Yas  Calisma Saati
Atil    0.956366 -0.362158       0.457712
Zeynep  0.456269 -0.846359       0.193361
Mehmet -0.697603 -0.462414       1.485745

In [33]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.956366 -0.362158       0.457712
Zeynep  0.456269 -0.846359       0.193361
Atlas  -0.322592  1.173666      -0.554441
Mehmet -0.697603 -0.462414       1.485745

In [34]:
yeniDataFrame.reset_index()

    index      Maas       Yas  Calisma Saati
0    Atil  0.956366 -0.362158       0.457712
1  Zeynep  0.456269 -0.846359       0.193361
2   Atlas -0.322592  1.173666      -0.554441
3  Mehmet -0.697603 -0.462414       1.485745

In [35]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.956366 -0.362158       0.457712
Zeynep  0.456269 -0.846359       0.193361
Atlas  -0.322592  1.173666      -0.554441
Mehmet -0.697603 -0.462414       1.485745

In [36]:
yeniIndeksListesi = ["Ati","Zey","Atl","Meh"]

In [37]:
yeniDataFrame["Yeni Indeks"] = yeniIndeksListesi

In [38]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Atil    0.956366 -0.362158       0.457712         Ati
Zeynep  0.456269 -0.846359       0.193361         Zey
Atlas  -0.322592  1.173666      -0.554441         Atl
Mehmet -0.697603 -0.462414       1.485745         Meh

In [39]:
yeniDataFrame.set_index("Yeni Indeks")

                 Maas       Yas  Calisma Saati
Yeni Indeks
Ati          0.956366 -0.362158       0.457712
Zey          0.456269 -0.846359       0.193361
Atl         -0.322592  1.173666      -0.554441
Meh         -0.697603 -0.462414       1.485745

In [40]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Atil    0.956366 -0.362158       0.457712         Ati
Zeynep  0.456269 -0.846359       0.193361         Zey
Atlas  -0.322592  1.173666      -0.554441         Atl
Mehmet -0.697603 -0.462414       1.485745         Meh

In [41]:
yeniDataFrame.set_index("Yeni Indeks",inplace=True)

In [42]:
yeniDataFrame

                 Maas       Yas  Calisma Saati
Yeni Indeks
Ati          0.956366 -0.362158       0.457712
Zey          0.456269 -0.846359       0.193361
Atl         -0.322592  1.173666      -0.554441
Meh         -0.697603 -0.462414       1.485745

In [43]:
yeniDataFrame.loc["Ati"]

Maas             0.956366
Yas             -0.362158
Calisma Saati    0.457712
Name: Ati, dtype: float64

In [44]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park", "South Park", "South Park"]

In [45]:
icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [46]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

In [47]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [48]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [49]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [50]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [51]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [52]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndeks,columns=["Yas","Meslek"])

In [53]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [54]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [55]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [56]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [57]:
cizgiFilmDataFrame.index.names = ["Film Adı","İsim"]

In [58]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F